recipes/dried-tomato-pasta-bake.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dried tomato pasta bake</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Dried tomato pasta bake</h1>
<p>
<a href="https://cupfulofkale.com/vegan-pasta-bake/#mv-creation-152-jtr">Original link</a>
</p>

<div id="outline-container-org4f58b6b" class="outline-2">
<h2 id="org4f58b6b">Ingredients</h2>
<div class="outline-text-2" id="text-org4f58b6b">
</div>
<div id="outline-container-org4687234" class="outline-3">
<h3 id="org4687234">Pasta Sauce</h3>
<div class="outline-text-3" id="text-org4687234">
<ul class="org-ul">
<li>1 red onion</li>
<li>4 garlic cloves</li>
<li>1 red pepper</li>
<li>2 tins (800g total) chopped tomatoes</li>
<li>3/4 cup water</li>
<li>5 sun dried tomatoes, in oil</li>
<li>2 tbsp tomato puree</li>
<li>1 tbsp balsamic vinegar</li>
<li>1 tsp sugar</li>
<li>1 tbsp mixed dried herbs</li>
<li>Pinch chilli flakes</li>
<li>6 vegan sausages</li>
</ul>
</div>
</div>

<div id="outline-container-org2b6278e" class="outline-3">
<h3 id="org2b6278e">White Sauce</h3>
<div class="outline-text-3" id="text-org2b6278e">
<ul class="org-ul">
<li>1.5 tbsp vegan butter</li>
<li>2 tbsp flour</li>
<li>3/4 cup unsweetened almond milk</li>
<li>1/2 tsp dijon mustard</li>
<li>50g vegan cheddar</li>
</ul>
</div>
</div>

<div id="outline-container-orgfe2ec8d" class="outline-3">
<h3 id="orgfe2ec8d">Everything else</h3>
<div class="outline-text-3" id="text-orgfe2ec8d">
<ul class="org-ul">
<li>350g penne pasta</li>
<li>1/4 cup vegan cheddar, grated</li>
<li>1/4 cup vegan mozzarella, grated</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org5d138a2" class="outline-2">
<h2 id="org5d138a2">Instructions</h2>
<div class="outline-text-2" id="text-org5d138a2">
<ol class="org-ol">
<li>Pre heat oven to 180&deg;C.</li>
<li>Finely chop the onion and place in a saucepan on medium heat with some oil. Leave to fry for a few minutes.</li>
<li>Mince the garlic and finely chop the red pepper and add to the pan. Cook for about 10 minutes until the onion and pepper are soft through.</li>
<li>Add the chopped tomatoes, water, finely chopped sun-dried tomatoes, tomato puree, balsamic vinegar, sugar, mixed herbs and pinch chilli flakes (optional). Bring to a gentle simmer and leave to cook for 15-20 minutes. It should have thickened and deepened in colour, add a little more water if you need to whilst cooking.</li>
<li>In a separate pan, heat some oil. Cut sausages into small chunks and fry until browned and crispy. Set aside.</li>
<li>Make the white sauce. Add vegan butter to a small saucepan on low heat. Once melted add the flour and mix until it forms a roux/paste.</li>
<li>Gradually add the milk and whisk continuously until smooth. Add the vegan cheddar and dijon mustard and whisk again until melted and thickened. Set aside.</li>
<li>Cook pasta until al dente. Drain and place in an oven proof dish.</li>
<li>Taste and season the tomato sauce and pour over the pasta with the cooked sausage. Stir well.</li>
<li>Pour the white sauce over the top so it is evenly distributed. Sprinkle the vegan cheddar and mozzarella on top and place in the oven for 20-25 minutes.</li>
<li>The cheese should be melted and the sides crispy and bubbling.</li>
<li>Serve and top with some fresh basil!</li>
</ol>
</div>
</div>
</div>
</body>
</html>
